Revit 2024 API
WireMaterialTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireMaterialTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As WireMaterialTypeSetIterator
Visual C++
public:
virtual WireMaterialTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace